In [2]:
import pandas as pd
import numpy as np

## Basics

In [5]:
emp={'id':[101,102,103,104,105,106],'name':['Deepak','Shyam','Arun','Manu','Vimal','shyam'],'age':[23,24,23,25,26,27],'salary':[23000,24000,25000,21000,24500,30000]}
df=pd.DataFrame(emp)
df

    id    name  age  salary
0  101  Deepak   23   23000
1  102   Shyam   24   24000
2  103    Arun   23   25000
3  104    Manu   25   21000
4  105   Vimal   26   24500
5  106   shyam   27   30000

In [5]:
#get shame of dataframe
df.shape

(6, 4)

In [6]:
#displays the first 5 rows of dataframe
df.head()

    id    name  age  salary
0  101  Deepak   23   23000
1  102   Shyam   24   24000
2  103    Arun   23   25000
3  104    Manu   25   21000
4  105   Vimal   26   24500

In [7]:
#Returns the specified numbers of records from the begining
df.head(3)

    id    name  age  salary
0  101  Deepak   23   23000
1  102   Shyam   24   24000
2  103    Arun   23   25000

In [8]:
#displays the last 5 rows of dataframe
df.tail()

    id   name  age  salary
1  102  Shyam   24   24000
2  103   Arun   23   25000
3  104   Manu   25   21000
4  105  Vimal   26   24500
5  106  shyam   27   30000

In [9]:
#Returns the specified numbers of records from the end
df.tail(3)

    id   name  age  salary
3  104   Manu   25   21000
4  105  Vimal   26   24500
5  106  shyam   27   30000

In [10]:
#Get names of the columns
df.columns

Index(['id', 'name', 'age', 'salary'], dtype='object')

In [11]:
#Acessing a specific column
df.age

0    23
1    24
2    23
3    25
4    26
5    27
Name: age, dtype: int64

In [12]:
df['age']

0    23
1    24
2    23
3    25
4    26
5    27
Name: age, dtype: int64

In [13]:
#Acessing multiple columns
df[['id','name','age']]

    id    name  age
0  101  Deepak   23
1  102   Shyam   24
2  103    Arun   23
3  104    Manu   25
4  105   Vimal   26
5  106   shyam   27

In [17]:
#Adding new column to a dataframe
new_data=df.copy()
address=['Delhi','lucknow','Patna','Delhi','Delhi','Goa']
new_data['address']=address
new_data

    id    name  age  salary  address
0  101  Deepak   23   23000    Delhi
1  102   Shyam   24   24000  lucknow
2  103    Arun   23   25000    Patna
3  104    Manu   25   21000    Delhi
4  105   Vimal   26   24500    Delhi
5  106   shyam   27   30000      Goa

In [15]:
new_data=new_data.drop('age',axis=1)
new_data

    id    name  salary  address
0  101  Deepak   23000    Delhi
1  102   Shyam   24000  lucknow
2  103    Arun   25000    Patna
3  104    Manu   21000    Delhi
4  105   Vimal   24500    Delhi
5  106   shyam   30000      Goa

In [18]:
new_data=new_data.drop(['age','name'],axis=1)
new_data

    id  salary  address
0  101   23000    Delhi
1  102   24000  lucknow
2  103   25000    Patna
3  104   21000    Delhi
4  105   24500    Delhi
5  106   30000      Goa

In [19]:
df.sort_values('age')

    id    name  age  salary
0  101  Deepak   23   23000
2  103    Arun   23   25000
1  102   Shyam   24   24000
3  104    Manu   25   21000
4  105   Vimal   26   24500
5  106   shyam   27   30000

In [20]:
#sorting values
df.sort_values('age',ascending=False)

    id    name  age  salary
5  106   shyam   27   30000
4  105   Vimal   26   24500
3  104    Manu   25   21000
1  102   Shyam   24   24000
0  101  Deepak   23   23000
2  103    Arun   23   25000

In [21]:
#view index 
df.index

RangeIndex(start=0, stop=6, step=1)

In [22]:
# change index to some other column name
data_index=df.set_index('id')
data_index

       name  age  salary
id
101  Deepak   23   23000
102   Shyam   24   24000
103    Arun   23   25000
104    Manu   25   21000
105   Vimal   26   24500
106   shyam   27   30000

In [23]:
# reset index to previous stage
data_index=data_index.reset_index()
data_index

    id    name  age  salary
0  101  Deepak   23   23000
1  102   Shyam   24   24000
2  103    Arun   23   25000
3  104    Manu   25   21000
4  105   Vimal   26   24500
5  106   shyam   27   30000

In [24]:
#loc
df.loc[3]

id          104
name       Manu
age          25
salary    21000
Name: 3, dtype: object

In [26]:
df.loc[df.name=="Manu"]

    id  name  age  salary
3  104  Manu   25   21000

In [27]:
dat=df.set_index('name')
dat

         id  age  salary
name
Deepak  101   23   23000
Shyam   102   24   24000
Arun    103   23   25000
Manu    104   25   21000
Vimal   105   26   24500
shyam   106   27   30000

In [29]:
dat.loc['Vimal']

id          105
age          26
salary    24500
Name: Vimal, dtype: int64

In [30]:
#iloc--pass only integer index
df.iloc[2]

id          103
name       Arun
age          23
salary    25000
Name: 2, dtype: object

In [31]:
dat.iloc[[0,4,2]]

         id  age  salary
name
Deepak  101   23   23000
Vimal   105   26   24500
Arun    103   23   25000

In [7]:
#dtypes
df.dtypes

id         int64
name      object
age        int64
salary     int64
dtype: object

## Regular Expression

In [3]:
data.replace({'temperrature': '[A-Za-z]','windspeed':'[A-Za-z]','event':'A-Za-z'},'',regrex=True)

NameError: name 'data' is not defined